# Label Utils Get Label For Discipline Method

Source: https://www.revitapidocs.com/2026/09ff409c-3deb-3bd8-d2ef-7eab4fbe4973.htm

---

| Label Utils Get Label For Discipline Method |
| --- |

Gets the user\-visible name for a discipline.
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public static string GetLabelForDiscipline(
	ForgeTypeId disciplineTypeId
)
```

```
Public Shared Function GetLabelForDiscipline (
	disciplineTypeId As ForgeTypeId
) As String
```

```
public:
static String^ GetLabelForDiscipline(
	ForgeTypeId^ disciplineTypeId
)
```

```
static member GetLabelForDiscipline :
        disciplineTypeId : ForgeTypeId -> string
```

#### Parameters

disciplineTypeId ForgeTypeId
:   Identifier of the discipline.

#### Return Value

String
Returns the user\-visible name for a discipline. Exceptions

| Exception | Condition |
| --- | --- |
| ArgumentException | Discipline must have a definition. |
| ArgumentNullException | A non\-optional argument was null |

Remarks The name is obtained in the current Revit language. See Also

#### Reference

LabelUtils Class Autodesk.Revit.DB Namespace